RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL25Z4/include/MKL25Z4_extension.h
/*******************************************************************************
 * UART_D - UART Data Register
 ******************************************************************************/

/*!
 * @brief UART_D - UART Data Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register is actually two separate registers. Reads return the contents
 * of the read-only receive data buffer and writes go to the write-only transmit
 * data buffer. Reads and writes of this register are also involved in the
 * automatic flag clearing mechanisms for the UART status flags.
 */
/*!
 * @name Constants and macros for entire UART_D register
 */
/*@{*/
#define UART_RD_D(base)          (UART_D_REG(base))
#define UART_WR_D(base, value)   (UART_D_REG(base) = (value))
#define UART_RMW_D(base, mask, value) (UART_WR_D(base, (UART_RD_D(base) & ~(mask)) | (value)))
#define UART_SET_D(base, value)  (BME_OR8(&UART_D_REG(base), (uint8_t)(value)))
#define UART_CLR_D(base, value)  (BME_AND8(&UART_D_REG(base), (uint8_t)(~(value))))
#define UART_TOG_D(base, value)  (BME_XOR8(&UART_D_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual UART_D bitfields
 */

/*!
 * @name Register UART_D, field R0T0[0] (RW)
 *
 * Read receive data buffer 0 or write transmit data buffer 0.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R0T0 field. */
#define UART_RD_D_R0T0(base) ((UART_D_REG(base) & UART_D_R0T0_MASK) >> UART_D_R0T0_SHIFT)
#define UART_BRD_D_R0T0(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R0T0_SHIFT, UART_D_R0T0_WIDTH))

/*! @brief Set the R0T0 field to a new value. */
#define UART_WR_D_R0T0(base, value) (UART_RMW_D(base, UART_D_R0T0_MASK, UART_D_R0T0(value)))
#define UART_BWR_D_R0T0(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R0T0_SHIFT), UART_D_R0T0_SHIFT, UART_D_R0T0_WIDTH))
/*@}*/

/*!
 * @name Register UART_D, field R1T1[1] (RW)
 *
 * Read receive data buffer 1 or write transmit data buffer 1.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R1T1 field. */
#define UART_RD_D_R1T1(base) ((UART_D_REG(base) & UART_D_R1T1_MASK) >> UART_D_R1T1_SHIFT)
#define UART_BRD_D_R1T1(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R1T1_SHIFT, UART_D_R1T1_WIDTH))

/*! @brief Set the R1T1 field to a new value. */
#define UART_WR_D_R1T1(base, value) (UART_RMW_D(base, UART_D_R1T1_MASK, UART_D_R1T1(value)))
#define UART_BWR_D_R1T1(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R1T1_SHIFT), UART_D_R1T1_SHIFT, UART_D_R1T1_WIDTH))
/*@}*/

/*!
 * @name Register UART_D, field R2T2[2] (RW)
 *
 * Read receive data buffer 2 or write transmit data buffer 2.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R2T2 field. */
#define UART_RD_D_R2T2(base) ((UART_D_REG(base) & UART_D_R2T2_MASK) >> UART_D_R2T2_SHIFT)
#define UART_BRD_D_R2T2(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R2T2_SHIFT, UART_D_R2T2_WIDTH))

/*! @brief Set the R2T2 field to a new value. */
#define UART_WR_D_R2T2(base, value) (UART_RMW_D(base, UART_D_R2T2_MASK, UART_D_R2T2(value)))
#define UART_BWR_D_R2T2(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R2T2_SHIFT), UART_D_R2T2_SHIFT, UART_D_R2T2_WIDTH))
/*@}*/

/*!
 * @name Register UART_D, field R3T3[3] (RW)
 *
 * Read receive data buffer 3 or write transmit data buffer 3.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R3T3 field. */
#define UART_RD_D_R3T3(base) ((UART_D_REG(base) & UART_D_R3T3_MASK) >> UART_D_R3T3_SHIFT)
#define UART_BRD_D_R3T3(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R3T3_SHIFT, UART_D_R3T3_WIDTH))

/*! @brief Set the R3T3 field to a new value. */
#define UART_WR_D_R3T3(base, value) (UART_RMW_D(base, UART_D_R3T3_MASK, UART_D_R3T3(value)))
#define UART_BWR_D_R3T3(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R3T3_SHIFT), UART_D_R3T3_SHIFT, UART_D_R3T3_WIDTH))
/*@}*/

/*!
 * @name Register UART_D, field R4T4[4] (RW)
 *
 * Read receive data buffer 4 or write transmit data buffer 4.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R4T4 field. */
#define UART_RD_D_R4T4(base) ((UART_D_REG(base) & UART_D_R4T4_MASK) >> UART_D_R4T4_SHIFT)
#define UART_BRD_D_R4T4(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R4T4_SHIFT, UART_D_R4T4_WIDTH))

/*! @brief Set the R4T4 field to a new value. */
#define UART_WR_D_R4T4(base, value) (UART_RMW_D(base, UART_D_R4T4_MASK, UART_D_R4T4(value)))
#define UART_BWR_D_R4T4(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R4T4_SHIFT), UART_D_R4T4_SHIFT, UART_D_R4T4_WIDTH))
/*@}*/

/*!
 * @name Register UART_D, field R5T5[5] (RW)
 *
 * Read receive data buffer 5 or write transmit data buffer 5.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R5T5 field. */
#define UART_RD_D_R5T5(base) ((UART_D_REG(base) & UART_D_R5T5_MASK) >> UART_D_R5T5_SHIFT)
#define UART_BRD_D_R5T5(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R5T5_SHIFT, UART_D_R5T5_WIDTH))

/*! @brief Set the R5T5 field to a new value. */
#define UART_WR_D_R5T5(base, value) (UART_RMW_D(base, UART_D_R5T5_MASK, UART_D_R5T5(value)))
#define UART_BWR_D_R5T5(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R5T5_SHIFT), UART_D_R5T5_SHIFT, UART_D_R5T5_WIDTH))
/*@}*/

/*!
 * @name Register UART_D, field R6T6[6] (RW)
 *
 * Read receive data buffer 6 or write transmit data buffer 6.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R6T6 field. */
#define UART_RD_D_R6T6(base) ((UART_D_REG(base) & UART_D_R6T6_MASK) >> UART_D_R6T6_SHIFT)
#define UART_BRD_D_R6T6(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R6T6_SHIFT, UART_D_R6T6_WIDTH))

/*! @brief Set the R6T6 field to a new value. */
#define UART_WR_D_R6T6(base, value) (UART_RMW_D(base, UART_D_R6T6_MASK, UART_D_R6T6(value)))
#define UART_BWR_D_R6T6(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R6T6_SHIFT), UART_D_R6T6_SHIFT, UART_D_R6T6_WIDTH))
/*@}*/

/*!
 * @name Register UART_D, field R7T7[7] (RW)
 *
 * Read receive data buffer 7 or write transmit data buffer 7.
 */
/*@{*/
/*! @brief Read current value of the UART_D_R7T7 field. */
#define UART_RD_D_R7T7(base) ((UART_D_REG(base) & UART_D_R7T7_MASK) >> UART_D_R7T7_SHIFT)
#define UART_BRD_D_R7T7(base) (BME_UBFX8(&UART_D_REG(base), UART_D_R7T7_SHIFT, UART_D_R7T7_WIDTH))

/*! @brief Set the R7T7 field to a new value. */
#define UART_WR_D_R7T7(base, value) (UART_RMW_D(base, UART_D_R7T7_MASK, UART_D_R7T7(value)))
#define UART_BWR_D_R7T7(base, value) (BME_BFI8(&UART_D_REG(base), ((uint8_t)(value) << UART_D_R7T7_SHIFT), UART_D_R7T7_SHIFT, UART_D_R7T7_WIDTH))
/*@}*/

